Revit 2027 API
FamilyItemFactory.NewFormByThickenSingleSurface Method
Create a new Form element by thickening a single-surface form, and add it into the Autodesk Revit family document.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Form NewFormByThickenSingleSurface(
	bool isSolid,
	Form singleSurfaceForm,
	XYZ thickenDir
)
Public Function NewFormByThickenSingleSurface (
	isSolid As Boolean,
	singleSurfaceForm As Form,
	thickenDir As XYZ
) As Form
public:
Form^ NewFormByThickenSingleSurface(
	bool isSolid,
	Form^ singleSurfaceForm,
	XYZ^ thickenDir
)
member NewFormByThickenSingleSurface :
        isSolid : bool *
        singleSurfaceForm : Form *
        thickenDir : XYZ -> Form
Parameters
isSolid Boolean
Indicates if the Form is Solid or Void.
singleSurfaceForm Form
The single-surface form element. It can have one top/bottom face or one side face.
thickenDir XYZ
The offset of capped solid.
Return Value
Form
This function will modify the input singleSurfaceForm and return the same element.
See Also
Reference
FamilyItemFactory Class
Autodesk.Revit.Creation Namespace